InformationRegisters/РазрешеннаяНоменклатураРозницы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>РазрешеннаяНоменклатураРозницы</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Назначение</Name>
					<Comment>Товары или Материалы</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/РазрешеннаяНоменклатураРозницы/Ext/ManagerModule.bsl
Процедура УстановитьОтбор(Назначение, ДинамическийСписок, ИмяПоля) Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	РазрешеннаяНоменклатураРозницы.Номенклатура КАК Номенклатура
	|ИЗ
	|	РегистрСведений.РазрешеннаяНоменклатураРозницы КАК РазрешеннаяНоменклатураРозницы
	|ГДЕ
	|	РазрешеннаяНоменклатураРозницы.Назначение = &Назначение";
	
	Запрос.УстановитьПараметр("Назначение", Назначение);
	МассивНоменклатуры = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Номенклатура");;
	
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(ДинамическийСписок, ИмяПоля, МассивНоменклатуры, ВидСравненияКомпоновкиДанных.ВИерархии, "ОтборПоРазрешеннойВРознице", Истина, РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный);
		
КонецПроцедуры

//++ №11160
Процедура УстановитьУсловноеОформлениеНедоступныеГруппы(Назначение, ДинамическийСписок, ИмяПоля = Неопределено) Экспорт
	
	Если ИмяПоля = Неопределено Тогда
		ИмяПоля = "Ссылка";
	КонецЕсли;
		
	НедоступныеГруппы = ПолучитьНедоступныеГруппыНоменклатуры(Назначение);
	
	ЭлементОформления = ДинамическийСписок.УсловноеОформление.Элементы.Добавить();
	ЭлементОформления.Оформление.УстановитьЗначениеПараметра("Видимость", Ложь);
	
	ОтборПоГруппе = ЭлементОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборПоГруппе.ЛевоеЗначение = Новый ПолеКомпоновкиДанных(ИмяПоля);
	ОтборПоГруппе.ВидСравнения = ВидСравненияКомпоновкиДанных.ВСписке;
	ОтборПоГруппе.ПравоеЗначение = НедоступныеГруппы;
	
КонецПроцедуры

Функция ПолучитьНедоступныеГруппыНоменклатуры(Назначение) Экспорт
	
	МаксимальныйУровень = ЗначениеНастроекПовтИсп.ПолучитьМаксимальныйУровеньИерархииРазрешеннойНоменклатурыРозницы();
	
	Запрос = новый Запрос;
	Запрос.Текст = "
	|// Все группы
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Номенклатура.Ссылка КАК Ссылка,
	|	Номенклатура.Родитель КАК Родитель
	|ПОМЕСТИТЬ ВТ_Все_Группы
	|ИЗ
	|	Справочник.Номенклатура КАК Номенклатура
	|ГДЕ
	|	Номенклатура.ЭтоГруппа
	|;
	|///////////////////////////////////////////////
	|
	|// Родители элементов
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	СправочникНоменклатура.Родитель КАК Родитель
	|ПОМЕСТИТЬ ВТ_Родители_Запрос_1
	|ИЗ
	|	Справочник.Номенклатура КАК СправочникНоменклатура
	|ГДЕ
	|	СправочникНоменклатура.Ссылка В ИЕРАРХИИ
	|			(ВЫБРАТЬ
	|				РазрешеннаяНоменклатураРозницы.Номенклатура
	|			ИЗ
	|				РегистрСведений.РазрешеннаяНоменклатураРозницы КАК РазрешеннаяНоменклатураРозницы
	|			ГДЕ
	|				РазрешеннаяНоменклатураРозницы.Назначение = &Назначение)
	|	И НЕ СправочникНоменклатура.Родитель = Значение(Справочник.Номенклатура.ПустаяСсылка)
	|	И НЕ СправочникНоменклатура.ЭтоГруппа
	|;
	|///////////////////////////////////////////////////////////
	|";
	
	// Вычисляем родители родителей
	ЗапросРодители = "
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	Все_Группы.Родитель КАК Родитель
	|ПОМЕСТИТЬ ВТ_Родители_Запрос_#2
	|ИЗ
	|	ВТ_Все_Группы КАК Все_Группы
	|	
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_Родители_Запрос_#1 КАК Родители_Запрос_#1
	|		По Все_Группы.Ссылка = Родители_Запрос_#1.Родитель
	|ГДЕ
	|	НЕ Все_Группы.Родитель = Значение(Справочник.Номенклатура.ПустаяСсылка)
	|;
	|///////////////////////////////////////////////////////////
	|";
	
	Для Сч = 1 По МаксимальныйУровень Цикл
		
		Запрос.Текст = Запрос.Текст + СтрЗаменить(СтрЗаменить(ЗапросРодители, "#1", Формат(Сч, "ЧГ=0")), "#2", Формат(Сч + 1, "ЧГ=0"));
		
	КонецЦикла;
	
	// Объединяем
	Запрос.Текст = Запрос.Текст + "
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	Родители_Запрос_1.Родитель КАК Родитель
	|ПОМЕСТИТЬ ВТ_ДоступныеГруппы
	|ИЗ
	|	ВТ_Родители_Запрос_1 КАК Родители_Запрос_1
	|";
	
	ЗапросОбъединениеРодителей = "
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	Родители_Запрос_#1.Родитель КАК Родитель
	|ИЗ
	|	ВТ_Родители_Запрос_#1 КАК Родители_Запрос_#1
	|";
	
	Для Сч = 2 По МаксимальныйУровень+1 Цикл
		
		Запрос.Текст = Запрос.Текст + СтрЗаменить(ЗапросОбъединениеРодителей, "#1", Формат(Сч, "ЧГ=0"));
		
	КонецЦикла;
		
	Запрос.Текст = Запрос.Текст + "
	|;
	|///////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	Все_Группы.Ссылка КАК Ссылка
	|ИЗ
	|	ВТ_Все_Группы КАК Все_Группы
	|	
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ДоступныеГруппы КАК ДоступныеГруппы
	|		По Все_Группы.Ссылка = ДоступныеГруппы.Родитель
	|ГДЕ
	|	ДоступныеГруппы.Родитель ЕСТЬ NULL
	|";
	
	Запрос.УстановитьПараметр("Назначение", Назначение);
	
	МассивНесипользуемыхГрупп = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");
	
	Возврат МассивНесипользуемыхГрупп;
	
КонецФункции

Функция __ПолучитьНедоступныеГруппыНоменклатуры(Назначение) Экспорт
	
	// решение из https://infostart.ru/public/311136/
	Запрос = новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Номенклатура.Родитель КАК НачалоДуги,
	|	Номенклатура.Ссылка КАК КонецДуги
	|ПОМЕСТИТЬ ЗамыканияДлины1
	|ИЗ
	|	Справочник.Номенклатура КАК Номенклатура
	|ГДЕ
	|	НЕ Номенклатура.Родитель = ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	Номенклатура.Ссылка,
	|	Номенклатура.Ссылка
	|ИЗ
	|	Справочник.Номенклатура КАК Номенклатура";
	
	Рефрен = "ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ПерваяДуга.НачалоДуги КАК НачалоДуги,
	|	ВтораяДуга.КонецДуги КАК КонецДуги
	|ПОМЕСТИТЬ ЗамыканияДлины#2
	|ИЗ
	|	ЗамыканияДлины#1 КАК ПерваяДуга
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ЗамыканияДлины#1 КАК ВтораяДуга
	|		ПО ПерваяДуга.КонецДуги = ВтораяДуга.НачалоДуги
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ЗамыканияДлины#1";
	
	МаксимальнаяДлинаЗамыканий = 1;
	
	Пока МаксимальнаяДлинаЗамыканий < 5 Цикл
		Запрос.Текст = Запрос.Текст + "
		|;
		|////////////////////////////////////////////////////////////////////////////////
		|" + СтрЗаменить(СтрЗаменить(Рефрен, "#1", Формат(МаксимальнаяДлинаЗамыканий, "ЧГ=0")), "#2", Формат(2 * МаксимальнаяДлинаЗамыканий, "ЧГ=0"));
		МаксимальнаяДлинаЗамыканий = 2 * МаксимальнаяДлинаЗамыканий;
	КонецЦикла;
	
	Кульминация = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	РазрешеннаяНоменклатураРозницы.Номенклатура КАК Номенклатура
	|ПОМЕСТИТЬ ВТ_РазрешеннаяНоменклатура
	|ИЗ
	|	РегистрСведений.РазрешеннаяНоменклатураРозницы КАК РазрешеннаяНоменклатураРозницы
	|ГДЕ
	|	РазрешеннаяНоменклатураРозницы.Назначение = &Назначение
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	СправочникНоменклатура.Ссылка КАК Номенклатура
	|ПОМЕСТИТЬ ВТ_РазрешенныеЭлементы
	|ИЗ
	|	Справочник.Номенклатура КАК СправочникНоменклатура
	|ГДЕ
	|	СправочникНоменклатура.Ссылка В ИЕРАРХИИ
	|			(ВЫБРАТЬ
	|				РазрешеннаяНоменклатура.Номенклатура
	|			ИЗ
	|				ВТ_РазрешеннаяНоменклатура КАК РазрешеннаяНоменклатура)
	|	И НЕ СправочникНоменклатура.ЭтоГруппа
	|;
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	НачалоДуги КАК Предок,
	|	КонецДуги КАК Потомок
	|ПОМЕСТИТЬ ЗамыканияДлины#2
	|ИЗ
	|	ЗамыканияДлины#1
	|ГДЕ
	|	НЕ НачалоДуги = КонецДуги;
	|
	|УНИЧТОЖИТЬ ЗамыканияДлины#1;
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|    ЗамыканияДлины#2.Предок
	|ПОМЕСТИТЬ СписокИспользуемыхГрупп
	|ИЗ
	|    ЗамыканияДлины#2 КАК ЗамыканияДлины#2
	|ГДЕ
	|    ЗамыканияДлины#2.Потомок В (ВЫБРАТЬ
	|				РазрешенныеЭлементы.Номенклатура
	|			ИЗ
	|				ВТ_РазрешенныеЭлементы КАК РазрешенныеЭлементы)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|    ЗамыканияДлины#2.Предок КАК Родитель
	|ИЗ
	|    ЗамыканияДлины#2 КАК ЗамыканияДлины#2
	|        ЛЕВОЕ СОЕДИНЕНИЕ СписокИспользуемыхГрупп КАК СписокИспользуемыхГрупп
	|        ПО ЗамыканияДлины#2.Предок = СписокИспользуемыхГрупп.Предок
	|ГДЕ
	|    СписокИспользуемыхГрупп.Предок ЕСТЬ NULL 
	|
	|СГРУППИРОВАТЬ ПО
	|    ЗамыканияДлины#2.Предок";
	
	
	Запрос.Текст = Запрос.Текст + "
		|;
		|////////////////////////////////////////////////////////////////////////////////
		|" + СтрЗаменить(СтрЗаменить(Кульминация, "#1", Формат(МаксимальнаяДлинаЗамыканий, "ЧГ=0")), "#2", Формат(МаксимальнаяДлинаЗамыканий * 2, "ЧГ=0"));
	
	Запрос.УстановитьПараметр("Назначение", Назначение);
	
	МассивНесипользуемыхГрупп = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Родитель");
	
	Возврат МассивНесипользуемыхГрупп;
	
КонецФункции
//-- №11160
